{
  "backend/main.mo": "Motoko canister handling user profiles and recipe CRUD with access control for users and recipe owners.",
  "feature_evidence.json": "Feature-to-file mapping report showing which frontend files implement authentication, recipe browsing, editing, theming, and static assets.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each major frontend source file.",
  "frontend/index.css": "Global Tailwind base styles defining a warm OKLCH color palette and dark mode variables.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up the React Router, theme provider, and top‑level page routes for browsing, viewing, creating, and editing recipes.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with loading states and cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting new authenticated users to enter their name and save their profile.",
  "frontend/src/components/layout/AppFooter.tsx": "Footer displaying copyright info and a referral link to caffeine.ai.",
  "frontend/src/components/layout/AppHeader.tsx": "Header with logo, navigation, login button, and authenticated‑only new‑recipe shortcut.",
  "frontend/src/components/layout/AppLayout.tsx": "Page shell component wrapping content with header and footer.",
  "frontend/src/components/recipes/RecipeCard.tsx": "Clickable recipe card showing title, description, ingredient count, and step count.",
  "frontend/src/components/recipes/RecipeForm.tsx": "Provides a form component for creating or editing recipes, managing fields for title, description, ingredients, and steps with dynamic add/remove handlers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks to fetch recipes and user profile data using the authenticated actor.",
  "frontend/src/hooks/useRecipeMutations.ts": "Provides mutation hooks for creating, updating, deleting recipes, and saving user profiles, with cache invalidation and toasts.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles and theme variables with a food-themed color palette and dark mode adjustments.",
  "frontend/src/main.tsx": "Bootstraps the app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/RecipeDetailPage.tsx": "Displays recipe details, handles edit/delete actions for owners, and shows loading and not-found states.",
  "frontend/src/pages/RecipeEditorPage.tsx": "Page for creating or editing recipes, handling authentication, ownership checks, data loading, and submitting to create or update recipes.",
  "frontend/src/pages/RecipesBrowsePage.tsx": "Displays a public recipe list with loading states and optional profile setup prompt for authenticated users.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, fonts, animations, and plugins for project styling.",
  "project_state.json": "Project metadata describing features, requirements, and image asset needs for the recipe website."
}