{
  "backend/main.mo": "Main canister logic handling authorization, blob storage, user profiles, and full recipe CRUD with likes and comments.",
  "backend/migration.mo": "Migration module converting old recipe records to the new schema by adding photo, likes, and comments fields.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and tests with confidence levels.",
  "frontend-file-summaries.txt": "List of short summaries describing the purpose of each frontend file for documentation or planning.",
  "frontend/index.css": "Global Tailwind-based theme variables and color tokens defining light and dark mode styles.",
  "frontend/index.html": "Basic HTML page bootstrapping the frontend and loading the main React entry point.",
  "frontend/src/App.tsx": "Router and theme setup defining all major application routes including home, browse, detail, edit, and monetize pages.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with loading states and query cache resets.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog prompting new authenticated users to enter and save their display name.",
  "frontend/src/components/layout/AppFooter.tsx": "Footer showing copyright info and a link to caffeine.ai with tracking parameters.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the site header with navigation, brand logo, auth-aware links, and monetization/new-recipe buttons.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps the page with header, footer, and main content layout.",
  "frontend/src/components/monetize/AuthorMonetizationSection.tsx": "Displays support links and products for an author if available.",
  "frontend/src/components/monetize/ProductsManager.tsx": "Manages adding, editing, and deleting monetized products, saving them to the storefront.",
  "frontend/src/components/monetize/SupportLinksEditor.tsx": "Allows users to create, edit, and remove external support links tied to their storefront.",
  "frontend/src/components/recipes/RecipeCard.tsx": "Shows a clickable recipe summary with image, metadata, and navigation to details.",
  "frontend/src/components/recipes/RecipeForm.tsx": "Form for creating or editing recipes, including photo upload, ingredients, and steps.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login state and identity loading. Wraps AuthClient creation and exposes login, clear, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching recipes and user profiles through an actor, with conditional fetching based on authentication and actor availability.",
  "frontend/src/hooks/useRecipeMutations.ts": "Implements recipe-related mutations such as create, update, delete, like, and unlike, with query invalidation and toast notifications.",
  "frontend/src/hooks/useStorefrontMutations.ts": "Provides mutations for saving and deleting a user’s storefront, including cache invalidation and error handling with toasts.",
  "frontend/src/hooks/useStorefrontQueries.ts": "Contains hooks to fetch storefront, product, and support link data for the caller or other users using React Query.",
  "frontend/src/index.css": "Sets up Tailwind base styles and color variables, defining a warm theme and dark mode plus recipe hero component styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders the root component.",
  "frontend/src/pages/HomePage.tsx": "Home page showing recent recipes, hero section, and conditional UI for authenticated users, including profile setup prompting.",
  "frontend/src/pages/MonetizePage.tsx": "Displays monetization settings, prompting login if needed and showing support link and product editors when authenticated.",
  "frontend/src/pages/RecipeDetailPage.tsx": "Shows a full recipe with likes, comments, edit/delete for owners, and author monetization info.",
  "frontend/src/pages/RecipeEditorPage.tsx": "Provides create/edit recipe functionality with photo upload, authentication checks, and navigation handling.",
  "frontend/src/pages/RecipesBrowsePage.tsx": "Lists all recipes with loading states and optional profile-setup prompt for new authenticated users.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for getting, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, typography, animations, and container settings.",
  "project_state.json": "Defines project metadata, existing features, known issues, and architectural notes for a recipe‑sharing web app. Captures authentication, recipe management, theming, asset generation, and monetization features."
}