{
  "kind": "build_request",
  "title": "Add Home page, recent recipes feed, comments, likes, and recipe photos",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Add a dedicated Home page that is the main landing page and provides access to a 'New recipes from other users' feed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Create new app Which work as same as this website but having home page , new recipes from other user"
        ]
      },
      "acceptanceCriteria": [
        "Visiting the root route ('/') shows a Home page (not the current browse grid view).",
        "The Home page includes a section labeled in English that shows a list of recent recipes.",
        "From the Home page, users can navigate to a full browse/listing page of recipes."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Implement backend support and frontend querying for a 'recent recipes' feed suitable for the Home page, ordered by creation time (newest first) and optionally filterable to exclude recipes authored by the caller when the caller is authenticated.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "new recipes from other user"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a query method that returns recipes sorted by createdAt descending (newest first).",
        "When the caller is authenticated, the frontend can request a 'recent recipes from other users' feed that excludes the caller's own recipes; when unauthenticated, the feed shows recent recipes without filtering by owner.",
        "The Home page uses this feed and shows the newest recipes first."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Add recipe comments: visitors can read comments on a recipe detail page, and authenticated users can add new comments.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "add custom recipes, coments"
        ]
      },
      "acceptanceCriteria": [
        "Recipe detail page shows a comments section that loads and renders existing comments for the recipe for any visitor (including signed-out users).",
        "Authenticated users can submit a new comment; after submission the new comment appears in the list without a full page refresh.",
        "Backend enforces that only authenticated users can create comments.",
        "Comment records include at least: recipeId, author principal, comment text, and createdAt timestamp."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Add recipe likes: visitors can see a recipe's like count, and authenticated users can like/unlike a recipe. Prevent multiple likes by the same user.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "and like to recepie"
        ]
      },
      "acceptanceCriteria": [
        "Recipe detail page displays a like button and a like count.",
        "If the user is signed in, clicking the like button toggles like/unlike for that user and updates the displayed count accordingly.",
        "If the user is signed out, the UI does not allow liking (e.g., disabled button or prompts to log in).",
        "Backend guarantees a user can only contribute at most one like per recipe (idempotent like).",
        "Recipe cards/listings can display the like count (at least on the recipe detail page it must be visible)."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Allow authors to attach food photos to their own recipes during creation/editing, store the images on the canister with reasonable size/type limits, and display the photos on recipe detail and in recipe listings (thumbnail/preview).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "with adding pictures of food in own recipes"
        ]
      },
      "acceptanceCriteria": [
        "Recipe create/edit form supports selecting at least one image file and submitting it with the recipe.",
        "Backend stores recipe image data in a way that survives page refresh and canister upgrades, with explicit limits (e.g., max file size and allowed mime types) and rejects uploads that exceed limits.",
        "Recipe detail page renders the attached photo(s) for the recipe.",
        "Recipe listing cards show a thumbnail/preview when an image exists for the recipe.",
        "Only the recipe owner can add/remove/replace photos for their own recipes."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo.",
    "Frontend must not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any files under frontend/src/components/ui (compose instead).",
    "User-facing text must be in English.",
    "If any stable-state schema changes are required to support comments/likes/photos, add a conditional backend migration following the project’s migration policy."
  ],
  "nonGoals": [
    "Implementing third-party authentication providers (only Internet Identity is supported).",
    "Real-time comment updates via websockets or push notifications.",
    "External image hosting/CDN integration; recipe photos must be stored within the Internet Computer canister constraints.",
    "Adding monetization features beyond what already exists."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}