{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Home page + recent feed, comments, likes, and recipe photos (frontend)",
  "requirements": [
    {
      "id": "REQ-10",
      "summary": "Add a dedicated Home page at '/' with a 'New recipes from other users' section and navigation to the full recipes browse page.",
      "acceptanceCriteria": [
        "Visiting the root route ('/') shows a Home page (not the current browse grid view).",
        "The Home page includes a section labeled in English that shows a list of recent recipes.",
        "From the Home page, users can navigate to a full browse/listing page of recipes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "create",
          "description": "Create the Home page UI with an English-labeled 'New recipes from other users' section that renders a recent recipe list and includes a clear navigation control to the full browse/listing page."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new Home page to the root route ('/') and move the existing browse grid to a dedicated route (e.g., '/recipes') so '/' is the landing page."
        },
        {
          "path": "frontend/src/components/layout/AppHeader.tsx",
          "operation": "modify",
          "description": "Update header navigation to include Home ('/') and Browse Recipes (the new browse route) so users can reach the full listing from the Home page and header."
        },
        {
          "path": "frontend/src/pages/RecipesBrowsePage.tsx",
          "operation": "modify",
          "description": "Adjust any copy/links that assume '/' is the browse page and ensure navigation targets the new browse route where appropriate."
        },
        {
          "path": "frontend/src/pages/RecipeDetailPage.tsx",
          "operation": "modify",
          "description": "Update 'Back to Recipes' navigation to point to the new browse route while keeping the Home page available at '/'."
        },
        {
          "path": "frontend/src/pages/RecipeEditorPage.tsx",
          "operation": "modify",
          "description": "Update any 'Back' navigation and unauthorized redirects that currently send users to '/' so they correctly go to the browse route (while '/' remains the Home landing page)."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Query and render a recent-recipes feed for the Home page (newest first) and support excluding the signed-in user's own recipes when authenticated.",
      "acceptanceCriteria": [
        "Backend exposes a query method that returns recipes sorted by createdAt descending (newest first).",
        "When the caller is authenticated, the frontend can request a 'recent recipes from other users' feed that excludes the caller's own recipes; when unauthenticated, the feed shows recent recipes without filtering by owner.",
        "The Home page uses this feed and shows the newest recipes first."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query hook for the recent-recipes feed that calls the backend capability for recent recipes and supports an exclude-own flag derived from authentication state."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Use the recent-recipes hook to render the Home page feed in newest-first order, and when authenticated request 'recent recipes from other users' by enabling the exclude-own option. Use the authorization component’s frontend guidance to determine authenticated state; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/recipes/RecipeCard.tsx",
          "operation": "modify",
          "description": "Ensure recipe cards used by the Home recent feed can display the minimal metadata needed for a 'recent recipes' list consistently with the browse listing (and remain clickable to the recipe detail page)."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Display recipe comments on the recipe detail page for all visitors and allow authenticated users to add comments with optimistic UI refresh.",
      "acceptanceCriteria": [
        "Recipe detail page shows a comments section that loads and renders existing comments for the recipe for any visitor (including signed-out users).",
        "Authenticated users can submit a new comment; after submission the new comment appears in the list without a full page refresh.",
        "Backend enforces that only authenticated users can create comments.",
        "Comment records include at least: recipeId, author principal, comment text, and createdAt timestamp."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useRecipeMutations.ts",
          "operation": "modify",
          "description": "Add a mutation hook to create a new comment for a recipe. After success, invalidate/refetch the recipe detail query so the new comment appears without a full page refresh. Use the authorization component’s frontend guidance to require login before allowing the mutation; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/RecipeDetailPage.tsx",
          "operation": "modify",
          "description": "Add a Comments section that renders existing comments for visitors and shows an authenticated-only comment composer (signed-out users see a disabled composer or a login prompt). On submit, call the comment mutation and refresh the displayed comment list without navigating away. Use English user-facing text."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Show like count and provide authenticated like/unlike toggling on the recipe detail page, while preventing likes for signed-out users.",
      "acceptanceCriteria": [
        "Recipe detail page displays a like button and a like count.",
        "If the user is signed in, clicking the like button toggles like/unlike for that user and updates the displayed count accordingly.",
        "If the user is signed out, the UI does not allow liking (e.g., disabled button or prompts to log in).",
        "Backend guarantees a user can only contribute at most one like per recipe (idempotent like).",
        "Recipe cards/listings can display the like count (at least on the recipe detail page it must be visible)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a query hook to determine whether the currently authenticated user has liked a given recipe (disabled when signed out), so the detail page can render the correct toggle state."
        },
        {
          "path": "frontend/src/hooks/useRecipeMutations.ts",
          "operation": "modify",
          "description": "Add like and unlike mutation hooks. After success, invalidate/refetch the recipe detail query (and any recent/browse lists as needed) to keep counts and toggle state consistent. Use the authorization component’s frontend guidance to prevent signed-out users from triggering these mutations; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/RecipeDetailPage.tsx",
          "operation": "modify",
          "description": "Render a like button and like count. When signed in, allow toggling like/unlike and update the UI after mutation; when signed out, disable the control or prompt to log in. Use English user-facing text and handle authorization failures gracefully."
        },
        {
          "path": "frontend/src/components/recipes/RecipeCard.tsx",
          "operation": "modify",
          "description": "Optionally display like count on recipe cards used in browse/home feeds to improve consistency with the detail view."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Support selecting and submitting recipe photos during create/edit, and display stored photos on recipe detail and in listings as thumbnails/previews.",
      "acceptanceCriteria": [
        "Recipe create/edit form supports selecting at least one image file and submitting it with the recipe.",
        "Backend stores recipe image data in a way that survives page refresh and canister upgrades, with explicit limits (e.g., max file size and allowed mime types) and rejects uploads that exceed limits.",
        "Recipe detail page renders the attached photo(s) for the recipe.",
        "Recipe listing cards show a thumbnail/preview when an image exists for the recipe.",
        "Only the recipe owner can add/remove/replace photos for their own recipes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/recipes/RecipeForm.tsx",
          "operation": "modify",
          "description": "Extend the recipe form to support selecting an image file and (in edit mode) replacing/removing the existing photo. Add client-side checks for reasonable file size and allowed image mime types before submit. Use the blob-storage component’s ExternalBlob representation on the frontend integration path; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/RecipeEditorPage.tsx",
          "operation": "modify",
          "description": "Plumb the form’s selected photo/removal intent into the submit flow for create/edit. Ensure edit-mode ownership gating continues to prevent non-owners from changing photos (UI-level enforcement)."
        },
        {
          "path": "frontend/src/hooks/useRecipeMutations.ts",
          "operation": "modify",
          "description": "Update create/update recipe mutations to accept an optional photo selection and pass it using the blob-storage component’s ExternalBlob type when calling the backend capability. Ensure query invalidation refreshes listings and detail so updated photos appear. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/RecipeDetailPage.tsx",
          "operation": "modify",
          "description": "Render the recipe photo (when present) using the blob-storage component’s ExternalBlob direct URL capability for efficient display/caching. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/recipes/RecipeCard.tsx",
          "operation": "modify",
          "description": "Show a thumbnail/preview image on recipe cards when a photo exists, using the blob-storage component’s ExternalBlob direct URL. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}